app/controllers/microposts_controller.rb

    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save
---
INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Lisp"], ["picture", "lisplogo_alien_256.png"], ["user_id", 102], ["created_at", "2016-03-17 07:29:07.256454"], ["updated_at", "2016-03-17 07:29:07.256454"]]